#位运算
# 或运算 |   与 运算 &


#十进制的数不能以0开头，否则报错invalid token   开头加上0b表示这个是二进制数
a=0b000111
b=0b000110
print('二进制与',a&b)   #二进制与  遇到0就为0，全1才是1    这里输出的是十进制数
print('输出二进制格式',bin(a&b))   #输出二进制格式


print(0b000111)#对应十进制7
print(0b000110)# 十进制6
print('十进制与',6&7)#跟二进制一样

print('000111右移:',bin(a>>1)) #右移相当于除以2
print('000111右移:',bin(a>>22))

print("十进制转2进制",bin(3))
print("十进制转2进制",bin(3>>1))
print("十进制转2进制",3>>1)  #3/2=1.5    右移相当于/2 取整数部分
# 

#奇数的0次方位含1，偶数没有
print(0x1)
print('1是否奇数',1 & 0b1)
print('4是否奇数',4 & 0b1)







